

romkatv/zsh-defer kind:clone 
# defered plugins




# git hub repos
mroth/evalcache
mafredri/zsh-async
zpm-zsh/ls
jeffreytse/zsh-vi-mode
MichaelAquilina/zsh-you-should-use
qoomon/zsh-lazyload


# oh my zsh plugins
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/aliases
ohmyzsh/ohmyzsh path:plugins/brew
ohmyzsh/ohmyzsh path:plugins/bundler
ohmyzsh/ohmyzsh path:plugins/bun
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/encode64
ohmyzsh/ohmyzsh path:plugins/fzf
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/gradle
ohmyzsh/ohmyzsh path:plugins/mongocli
ohmyzsh/ohmyzsh path:plugins/macos
ohmyzsh/ohmyzsh path:plugins/npm
ohmyzsh/ohmyzsh path:plugins/nmap
ohmyzsh/ohmyzsh path:plugins/nvm kind:defer
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/postgres kind:defer
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/rust
ohmyzsh/ohmyzsh path:plugins/tmux
ohmyzsh/ohmyzsh path:plugins/thefuck
ohmyzsh/ohmyzsh path:plugins/yarn
ohmyzsh/ohmyzsh path:plugins/vagrant
ohmyzsh/ohmyzsh path:plugins/wp-cli
ohmyzsh/ohmyzsh path:plugins/zoxide

#theme
romkatv/powerlevel10k kind:fpath

romkatv/zsh-bench kind:path

zpm-zsh/mysql-colorize kind:defer
zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-autosuggestions kind:defer
reegnz/jq-zsh-plugin kind:defer
caarlos0/zsh-pg kind:defer
Aloxaf/fzf-tab kind:defer

MenkeTechnologies/zsh-more-completions
# mattmc3/zephyr path:plugins/completion



# save this for a reference
# https://getantidote.github.io/
# local plugins
#~/foo/bar
#$ZDOTDIR/foo/bar
#$ZDOTDIR/foo/bar path:baz
