alt-tab
anki
apparency
applite
background-music
betterzip
bitwarden
brave-browser
chatgpt
chatgpt-atlas
chromedriver
claude
claude-code
clipgrab
codex
coteditor
devutils
diffusionbee
discord
displaylink
docker-desktop
exifcleaner
font-symbols-only-nerd-font
gcloud-cli
github
gitkraken
google-chrome
handbrake-app
hiddenbar
iina
iterm2
jetbrains-toolbox
keycastr
libreoffice
librewolf
linear-linear
linkliar
logi-options+
logi-options+
masscode
mdimagesizemdimporter
microsoft-edge
mullvad-vpn
obs
obs-websocket
orbstack
orion
pgadmin4
platypus
powershell
provisionql
qlimagesize
qlzipinfo
rapidapi
raycast
requestly
signal
sony-ps-remote-play
stats
super-productivity
suspicious-package
swift-quit
switchhosts
syntax-highlight
textmate
utm
vimr
visual-studio-code@insiders
warp
wezterm
zed
zoom
